Repository: ubports/calculator-app
Catalog: po/*.po
Languages: cs, de, it, ru

source: Calculator
cs: Kalkulačka
de: Taschenrechner
it: Calcolatrice
ru: Калькулятор

source: Favorite
cs: Oblíbené
de: Favoriten
it: Preferito
ru: Избранное

source: Cancel
cs: Zrušit
de: Abbrechen
it: Annulla
ru: Отменить

source: Select All
cs: Vybrat vše
de: Alles auswählen
it: Seleziona Tutto
ru: Выбрать всё

source: Select None
cs: Zrušit výběr
de: Auswahl aufheben
ru: Снять выделение

source: Copy
cs: Kopírovat
de: Kopieren
it: Copia
ru: Копировать

source: Delete
cs: Smazat
de: Löschen
it: Elimina
ru: Удалить

source: Edit
cs: Upravit
de: Bearbeiten
it: Modifica
ru: Правка

source: Add to favorites
cs: Přidat do oblíbených
de: Zu Favoriten hinzufügen
it: Aggiungi ai preferiti
ru: Добавить в избранное

source: No favorites
cs: Žádné oblíbené položky
de: Keine Favoriten
it: Nessun preferito
ru: Нет избранного

source: Swipe calculations to the left to mark as favorites
cs: K označení oblíbených výpočtů přetáhněte je doleva
de: Wischen Sie Berechnungen nach links um sie als Favoriten zu markieren
it: Scorrere i calcoli a sinistra per contrassegnarli come preferiti
ru: Проведите по вычислениям влево чтобы добавить в избранное

source: mod
cs: režim

source: Just now
cs: Právě teď
de: Gerade eben
it: Ora
ru: Сейчас

source: Today
cs: Dnes
de: Heute
it: Oggi
ru: Сегодня

source: Yesterday
cs: Včera
de: Gestern
it: Ieri
ru: Вчера

source: Skip
cs: Přeskočit
de: überspringen
it: Salta
ru: Пропустить

source: Welcome to Calculator
cs: Vítejte v Kalkulačce
de: Willkommen im Taschenrechner
it: Benvenuti in «Calcolatrice»
ru: Добро пожаловать в Калькулятор!

source: Enjoy the power of math by using Calculator
cs: Užívejte si sílu matematiky s Kalkulačkou
de: Genießen Sie die Macht der Mathematik, indem Sie den Taschenrechner benutzen
it: Divertiti con il potere della matematica usando «Calcolatrice»
ru: Почувствуйте силу математики, используя Калькулятор

source: Copy formula
cs: Kopírovat vzorec
de: Formel kopieren
it: Copia formula
ru: Скопировать формулу

source: Long press to copy part or all of a formula to the clipboard
cs: Delším přitlačením zkopírujte část nebo celý vzorec do schránky
de: Gedrückt halten, um eine Formel teilweise oder ganz in die Zwischenablage zu kopieren
it: Premere a lungo per copiare tutta la formula o solo una parte negli appunti
ru: Нажмите и удерживайте, чтобы скопировать часть или всю формулу в буфер обмена

source: Enjoy
cs: Užijte si to
de: Viel Spaß
it: Divertiti
ru: Наслаждайтесь

source: We hope you enjoy using Calculator!
cs: Věříme, že se vám používání kalkulačky líbí!
de: Wir hoffen, dass Sie viel Freude mit diesem Taschenrechner haben!
it: Speriamo tu possa essere soddisfatto usando Calcolatrice!
ru: Надеемся вам понравится использовать Калькулятор!

source: Finish
cs: Dokončit
de: Fertig
it: Fine
ru: Закончить

source: Scientific keyboard
cs: Vědecká klávesnice
de: Wissenschaftliche Tastatur
it: Calcolatrice scientifica
ru: Научная клавиатура

source: Access scientific functions with a left swipe on the numeric keypad
cs: K použití vědeckých funkcí přetáhněte numerickou klávesnici doleva
de: Wissenschaftliche Funktionen durch Wischen nach links aufrufen
it: Accedi alle funzioni scientifiche con un scorrimento da sinistra sul tastierino numerico
ru: Получите доступ к научным функциям, проведя влево по числовому блоку клавиатуры

source: Scientific View
cs: Vědecký režim
de: Wissenschaftliche Ansicht
it: Vista scientifica
ru: Научный вид

source: Rotate device to show numeric and scientific functions together
cs: Pro zobrazení číselných i vědeckých funkcí zároveň otočte zařízení
de: Gerät drehen, um numerische und wissenschaftliche Funktionen nebeneinander anzuzeigen
it: Ruota il dispositivo per mostrare insieme le funzioni numeriche e scientifiche
ru: Поверните устройство, чтобы увидеть цифровую и научную клавиатуру вместе

source: Delete item from calculation history
cs: Smazat záznam z historie výpočtů
de: Lösche ein Element aus dem Berechnungsverlauf
it: Elimina elemento dalla cronologia dei calcoli
ru: Удалить из истории калькулятора

source: Swipe right to delete items from calculator history
cs: Přetažením doprava smažete záznam z historie výpočtů
de: Nach rechts wischen, um einen Eintrag aus dem Verlauf des Taschenrechners zu löschen
it: Scorrere verso destra per eliminare gli elementi dalla cronologia dei calcoli
ru: Проведите вправо, чтобы удалить пример из истории калькулятора

source: Delete several items from calculation history
cs: Smazat více záznamů z historie výpočtů
de: Lösche mehrere Elemente aus dem Berechnungsverlauf
it: Elimina più elementi dalla cronologia dei calcoli
ru: Удалить несколько выражений из истории калькулятора

source: Long press to select multiple calculations for deletion
cs: Delší stisk pro výběr většího množství záznamů ke smazání
de: Gedrückt halten, um mehrere Berechnungen zum Löschen auszuwählen
it: Premere a lungo per selezionare più calcoli da eliminare
ru: Для удаления из истории нескольких примеров используйте выбор с помощью длинного нажатия

source: Delete whole formula at once
cs: Smazat celý vzorec najednou
de: Lösche die gesamte Formel
it: Elimina l'intera formula
ru: Удалить всю формулу разом

source: Long press '←' button to clear all formulas from input bar
cs: Delší stisk '←' pro vymazání všech vzorců ze vstupního panelu
de: Lange auf den '←'-Button tippen, um sämtliche Formeln aus dem Eingabefeld zu löschen
it: Premere a lungo il pulsante "←" per cancellare tutte le formule dalla barra di immissione
ru: Длинное нажатие на кнопку '←' очистит строку ввода

source: Edit item from calculation history
cs: Upravit záznam z historie výpočtů
de: Ein Element aus dem Berechnungsverlauf bearbeiten
it: Modifica elemento dalla cronologia dei calcoli
ru: Изменить пример из истории калькулятора

source: Swipe left and press pencil to edit calculation
cs: Pro úpravu výpočtu přetáhněte doleva a stiskněte tužku
de: Nach links wischen und den Stift antippen, um die Berechnung zu bearbeiten
it: Scorrere verso sinistra e premere la matita per modificare i calcoli
ru: Проведите влево и нажмите на карандаш для изменения примера

source: Add new favourite
cs: Přidat do oblíbených
de: Zu Favoriten hinzufügen
it: Aggiungi nuovo preferito
ru: Добавить в избранное

source: Swipe left and press star to add calculations to favourites view
cs: Pro přidání do oblíbených přetáhněte doleva a stiskněte hvězdičku
de: Nach links wischen und Stern antippen, um Berechnungen zur Favoritenansicht hinzuzufügen
it: Scorrere verso sinistra e premere la stella per aggiungere i calcoli ai preferiti
ru: Сдвиньте вправо и нажмите на звездочку, чтобы добавить пример в избранное

source: Edit formula
cs: Upravit vzorec
de: Formel bearbeiten
it: Modifica formula
ru: Изменить формулу

source: Click in the middle of a formula to edit in place
cs: Pro úpravu vzorce klikněte uprostřed vzorce
de: In die Mitte einer Formel klicken, um sie dort zu bearbeiten
it: Fare clic al centro della formula per modificarla direttamente
ru: Нажмите в середину формулы, чтобы изменить ее в каком-либо месте

source: A calculator for Ubuntu.
cs: Kalkulačka pro Ubuntu.
de: Ein Taschenrechner für Ubuntu.
it: Una calcolatrice per Ubuntu.
ru: Калькулятор для Ubuntu.

source: math;addition;subtraction;multiplication;division;
cs: matematika;sčítání;dělení;odčítání;násobení;
de: Mathe;Mathematik;Multiplikation;Subtraktion;Addition;Division;
it: matematica;addizioni;sottrazioni;moltiplicazioni;divisioni;
ru: математика;сложение;вычитание;умножение;деление;

source: log
de: ln
it: ln

source: NaN
it: Risultato indefinito
